src/cf/Catalogs/ГруппировкиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппировкиЗадач</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.ОтборыПоУчастникамЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПроекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезФлага</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриложения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидПриложенияЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:EnumRef.ОтборыПоУчастникамЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительРазыменован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:EnumRef.ОтборыПоПроектамЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
						<v8:Type>cfg:EnumRef.ОтборыПоСтатусуЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтбораГруппировокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПриложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриложенийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ГруппировкиЗадач/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет наименование группировки задач.
// 
// Возвращаемое значение:
//  Булево - Наименование обновлено.
// 
Функция ОбновитьНаименование() Экспорт
	
	НаименованиеОбновлено = Ложь;
	
	Если Предопределенный Тогда
		Возврат НаименованиеОбновлено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Автор) И ТипЗнч(Автор) = Тип("СправочникСсылка.Сотрудники")  Тогда
		НовоеНаименование = РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(Автор, Истина);
	ИначеЕсли ЗначениеЗаполнено(Автор) И ТипЗнч(Автор) = Тип("СправочникСсылка.ПолныеРоли")  Тогда
		НовоеНаименование = РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(Автор, Истина);
	ИначеЕсли БезПроекта Тогда
		НовоеНаименование = НСтр("ru = 'Без проекта'");
	ИначеЕсли БезФлага Тогда
		НовоеНаименование = НСтр("ru = 'Без флага'");
	ИначеЕсли ЗначениеЗаполнено(ВидДействия) Тогда
		НовоеНаименование = Строка(ВидДействия);
	ИначеЕсли ЗначениеЗаполнено(ВидЗадачи) Тогда
		НовоеНаименование = Строка(ВидЗадачи);
	ИначеЕсли ЗначениеЗаполнено(ВидПриложения) Тогда
		НовоеНаименование = Строка(ВидПриложения);
	ИначеЕсли ЗначениеЗаполнено(Исполнитель) И ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		НовоеНаименование = РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(Исполнитель, Истина);
	ИначеЕсли ЗначениеЗаполнено(Исполнитель) И ТипЗнч(Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		НовоеНаименование = Строка(Исполнитель);
	ИначеЕсли ЗначениеЗаполнено(Исполнитель) И ТипЗнч(Исполнитель) = Тип("СправочникСсылка.ПолныеРоли") Тогда
		НовоеНаименование = Строка(Исполнитель);
	ИначеЕсли ЗначениеЗаполнено(Проект) И ТипЗнч(Проект) = Тип("СправочникСсылка.Проекты") Тогда
		НовоеНаименование = Строка(Проект);
	ИначеЕсли ЗначениеЗаполнено(ТипПриложения) Тогда
		НовоеНаименование = Строка(ТипПриложения);
	ИначеЕсли ЗначениеЗаполнено(Флаг) Тогда
		НовоеНаименование = Строка(Флаг);
	Иначе
		НовоеНаименование = НСтр("ru = '<Не указан>'");
	КонецЕсли;
	
	Если НовоеНаименование <> Наименование Тогда
		НаименованиеОбновлено = Истина;
		Наименование = НовоеНаименование;
	КонецЕсли;
	
	Возврат НаименованиеОбновлено;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
	МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаименование();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
